In [95]:
import pandas as pd
import numpy as np

titanic = pd.read_csv("C:\\Users\\Siddhu\\Downloads\\titanic.csv")

In [69]:
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [70]:
titanic.isnull()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,False,False,False,False,False,False,False,False,False,False,True,False
1,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,True,False
3,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,True,False
...,...,...,...,...,...,...,...,...,...,...,...,...
886,False,False,False,False,False,False,False,False,False,False,True,False
887,False,False,False,False,False,False,False,False,False,False,False,False
888,False,False,False,False,False,True,False,False,False,False,True,False
889,False,False,False,False,False,False,False,False,False,False,False,False
890,False,False,False,False,False,False,False,False,False,False,True,False

In [71]:
titanic.isna().any()

PassengerId    False
Survived       False
Pclass         False
Name           False
Sex            False
Age             True
SibSp          False
Parch          False
Ticket         False
Fare           False
Cabin           True
Embarked        True
dtype: bool

In [72]:
titanic.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [73]:
titanic.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [8]:
titanic.notnull().sum()

PassengerId    891
Survived       891
Pclass         891
Name           891
Sex            891
Age            714
SibSp          891
Parch          891
Ticket         891
Fare           891
Cabin          204
Embarked       889
dtype: int64

In [9]:
titanic.shape

(891, 12)

In [86]:

#drop_titanic = titanic.dropna(axis=0)  # Drop rows
#drop_titanic = titanic.dropna(axis=1)  # Drop columns
#drop_titanic = titanic.dropna(how='any') # Drop rows with at least one missing value
#drop_titanic = titanic.dropna(how='all') # Drop rows where all values are missing
#drop_titanic = titanic.dropna(thresh=11)  # Keep rows with at least 'n' non-missing values
drop_titanic = titanic.dropna(subset=['Age','Embarked']) # Check only these column(s) for missing values

In [88]:
drop_titanic.shape

(712, 12)

In [98]:
#titanic.dropna(subset=['Age','Embarked'], inplace=False)
titanic.dropna(subset=['Age','Embarked'], inplace=True) # Modify the original DataFrame directly.

In [99]:
titanic.shape

(712, 12)

In [41]:
data = {'A': [1, np.nan, 3], 'B': [4, np.nan, np.nan], 'C': [7, 8, 9]}
df = pd.DataFrame(data)

print(df)

     A    B  C
0  1.0  4.0  7
1  NaN  NaN  8
2  3.0  NaN  9

In [101]:
df.fillna(999) # Replace NaN with constant

       A      B  C
0    1.0    4.0  7
1  999.0  999.0  8
2    3.0  999.0  9

In [103]:
print(df)

     A    B  C
0  1.0  4.0  7
1  NaN  NaN  8
2  3.0  NaN  9

In [104]:
df['A'].fillna(0)

0    1.0
1    0.0
2    3.0
Name: A, dtype: float64

In [105]:
df.fillna({'A':0})

     A    B  C
0  1.0  4.0  7
1  0.0  NaN  8
2  3.0  NaN  9

In [106]:
df.fillna({'A': +1.0, 'B': -1.0}) # Replace NaN with Different Values per Column

     A    B  C
0  1.0  4.0  7
1  1.0 -1.0  8
2  3.0 -1.0  9

In [107]:
print(df)
df.ffill() #Forward Fill Missing Values

     A    B  C
0  1.0  4.0  7
1  NaN  NaN  8
2  3.0  NaN  9

     A    B  C
0  1.0  4.0  7
1  1.0  4.0  8
2  3.0  4.0  9

In [108]:
df.ffill(limit=1)

     A    B  C
0  1.0  4.0  7
1  1.0  4.0  8
2  3.0  NaN  9

In [109]:
print(df)
df.bfill() #Backward Fill Missing Values

     A    B  C
0  1.0  4.0  7
1  NaN  NaN  8
2  3.0  NaN  9

     A    B  C
0  1.0  4.0  7
1  3.0  NaN  8
2  3.0  NaN  9

In [110]:
#df['column_name'].fillna(df['column_name'].mean(), inplace=True)
df['A'].fillna(df['A'].mean())

0    1.0
1    2.0
2    3.0
Name: A, dtype: float64

In [111]:
df.replace(to_replace=np.nan, value=0) # using replace()

     A    B  C
0  1.0  4.0  7
1  0.0  0.0  8
2  3.0  0.0  9